/*
 * Author: lihan@xx.cn
 * History: create at 20210811
 */

// 
//  data page node 数据页头结点存储分布
//  +------------+-----------+----------+-----------+
//  |  COL-NUM   |  ROW-SIZE |   PREV   |   NEXT    |   // 列数，行大小, prev/next 空闲链表相关
//  +------------+-----------+----+-----------------+
//  |    NAME    | TYPE-AUX  | KT |    KEY-NAME     |   // NAME：列名称(长64字节); 
//  +------------+-----------+----+-----------------+
//  |    NAME    | TYPE-AUX  | KT |    KEY-NAME     |   // TYPE-AUX: 列类型及辅助(4字节);
//  +------------+-----------+----+-----------------+
//  |    NAME    | TYPE-AUX  | KT |    KEY-NAME     |   // KT: 键类型(1字节);
//  +------------+-----------+----+-----------------+
//  |    NAME    | TYPE-AUX  | KT |    KEY-NAME     |   // KEY-NAME: 键名称(64字节);
//  +------------+-----------+----+-----------------+
//  |                  ......                       |
//  +-----------------------------------------------+
//  


class DataPage {

}

module.exports = DataPage